In [3]:
import pandas as ps

# 판다스 (Pandas)

pd.Series(data, index=index) -> 배열, 리스트, 딕셔너리 가능하다고 함

## 시리즈 (Series)

In [5]:
ps.Series(range(6))

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [6]:
index_s = ['a','b','c','d','e']
ser = ps.Series([1,2,3,4,5], index=index_s)
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
ser[0],ser['a']

C:\Users\Admin\AppData\Local\Temp\ipykernel_24004\143202658.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0],ser['a']

(np.int64(1), np.int64(1))

In [14]:
ser2 = ps.Series([10,'banana'])
type(ser2), ser2

(pandas.core.series.Series,
 0        10
 1    banana
 dtype: object)

In [20]:
je = {'지훈':31, '재이':31,'땡콩':32}

ser = ps.Series(je)
ser

지훈    31
재이    31
땡콩    32
dtype: int64

In [16]:
population = ps.Series([9776, 2729, 1566, 3158], 
                    index=['서울', '부산', '인천', '대구'])
print(population['서울'])  # 9776 출력
print(population[['서울', '부산']])  # 서울과 부산의 데이터만 선택

9776
서울    9776
부산    2729
dtype: int64

In [21]:
population.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [30]:
# ser[0], ser['a'] 과거엔 이렇게 호출햇음
ser.iloc[0],ser.loc['땡콩']

(np.int64(31), np.int64(32))

In [25]:
ser

지훈    31
재이    31
땡콩    32
dtype: int64

## 데이터 프레임 (Data Frame)

In [96]:
scientists = ps.DataFrame({
        "Name": ["jeehun", "ttenk kong"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1995-04-20", "1994-08-28"],
        "Died": ["2999-04-16", "2999-10-16"],
        "Age": [37, 61],
})

scientists

         Name    Occupation        Born        Died  Age
0      jeehun       Chemist  1995-04-20  2999-04-16   37
1  ttenk kong  Statistician  1994-08-28  2999-10-16   61

In [49]:
scientists.loc[1]

Name            ttenk kong
Occupation    Statistician
Born            1994-08-28
Died            2999-10-16
Age                     61
Name: 1, dtype: object

In [ ]:
scientists.index = ['jeehun','ttenk kong']

In [91]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

**loc** = location of colum  

**iloc** = index location of colum

In [67]:
data = {
    '이름': ['김철수', '이영희', '박민수'],
    '나이': [25, 28, 22],
    '점수': [85, 92, 78]
}
df = ps.DataFrame(data)
print(df)

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78

In [90]:
df.index = range(1, len(df)+1)

print(f'{df.loc[2]} \n\n {df.iloc[1]}')

이름    이영희
나이     28
점수     92
Name: 2, dtype: object

 이름    이영희
나이     28
점수     92
Name: 2, dtype: object

In [93]:
scientists.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, jeehun to ttenk kong
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 204.0+ bytes

In [99]:
scientists.loc[0,'Occupation']

'Chemist'

In [106]:
scientists.to_csv('./data/scientist_1.csv')

In [104]:
# 인덱스를 빼려면?
scientists.to_csv('./data/scientist_2.csv', index=False)

In [ ]:
#pickle : 파이썬의 객체형을 저장 
#pickle이란 것이 있다는 것만 알면 됨 , 자주 사용할 일은 없다고 함 
scientists.to_pickle('./data/scientist_1.pickle')

In [119]:
df3 = ps.read_pickle('./data/scientist_1.pickle')
df3

         Name    Occupation        Born        Died  Age
0      jeehun       Chemist  1995-04-20  2999-04-16   37
1  ttenk kong  Statistician  1994-08-28  2999-10-16   61

In [108]:
df = ps.read_csv('./data/scientist_2.csv')
df

         Name    Occupation        Born        Died  Age
0      jeehun       Chemist  1995-04-20  2999-04-16   37
1  ttenk kong  Statistician  1994-08-28  2999-10-16   61

In [111]:
df2 = ps.read_csv('./data/scientists.csv')
df2

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [125]:
df2.loc[0,'Name'] = 'jeehun'
df2.loc[0,'Born'] = '1995-04-20'
df2.loc[0:1]

             Name        Born        Died  Age    Occupation
0          jeehun  1995-04-20  1958-04-16   37       Chemist
1  William Gosset  1876-06-13  1937-10-16   61  Statistician

In [126]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

## 데이터 미리보기

1. info()
2.

In [ ]:
df2.head(9) # default = 5

                   Name        Born        Died  Age          Occupation
0                jeehun  1995-04-20  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [133]:
df2.tail(2)

           Name        Born        Died  Age          Occupation
6   Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7  Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [142]:
df2['Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [140]:
df2.loc[:,'Age']

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

### 데이터프레임 연습문제

In [171]:
import pandas as pd

# 샘플 데이터프레임 생성
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)

In [ ]:
# 처음 5개 행 보기

df.head(5)
df.head(-1)

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88

In [161]:
# df.tail(3)
df.tail(3), df.tail(-4)

(    이름  나이  점수
 4  최영호  27  88
 5  한미래  24  73
 6  윤지원  29  91,
     이름  나이  점수
 4  최영호  27  88
 5  한미래  24  73
 6  윤지원  29  91)

In [ ]:
# 데이터프레임 기본 정보

print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   점수      7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes
None

In [166]:
df.describe()

              나이         점수
count   7.000000   7.000000
mean   26.571429  86.000000
std     3.101459   7.958224
min    22.000000  73.000000
25%    24.500000  81.500000
50%    27.000000  88.000000
75%    28.500000  91.500000
max    31.000000  95.000000

In [179]:
df.index = ['A','B','C','D','E','F','G']

df.columns = ['name', 'age', 'score']

df

  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91